using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace project_4
{
    public partial class Form1 : Form
    {
        int[,] matrix1 = {
            { 0,180,180,350,470,520,570,630,770,830,870,770,950,890,1010,1010},
            { 180,0,360,300,420,470,520,660,740,780,820,720,900,840,960,960},
            { 180,360,0,200,320,370,420,450,590,680,720,620,800,740,860,860},
            { 350,300,200,0,120,170,220,360,440,480,520,420,600,540,660,660},
            { 470,420,320,120,0,50,220,360,440,420,400,300,540,420,540,540},
            { 520,470,370,170,50,0,270,410,490,370,350,250,490,370,490,490},
            { 570,520,420,220,220,270,0,140,220,260,320,420,380,500,580,620},
            { 630,660,450,360,360,410,140,0,140,400,460,560,520,640,720,760},
            { 770,740,590,440,440,490,220,140,0,260,320,420,380,500,580,620},
            { 830,780,680,480,420,370,260,400,260,0,60,160,120,240,320,360},
            { 870,820,720,520,400,350,320,460,320,60,0,100,160,220,340,340},
            { 770,720,620,420,300,250,420,560,420,160,100,0,240,120,240,240},
            { 950,900,800,600,540,490,380,520,380,120,160,240,0,120,200,240},
            { 890,840,740,540,420,370,500,640,500,240,220,120,120,0,120,120},
            { 1010,960,860,660,540,490,580,720,580,320,340,240,200,120,0,150},
            { 1010,960,860,660,540,490,620,760,620,360,340,240,240,120,150,0},
        }; 
        int[,] matrix2 = {
            { 0,180,180,990,990,1400,770,630,770,1030,1310,1390,1150,1270,1350,1390},
            { 180,0,360,1170,1170,1580,950,810,950,1210,1490,1570,1330,1450,1530,1570},
            { 180,360,0,810,810,1220,590,450,590,850,1130,1210,970,1090,1170,1210},
            { 990,1170,810,0,440,850,220,360,440,480,760,840,600,720,800,840},
            { 990,1170,810,440,0,850,220,360,440,480,760,840,600,720,800,840},
            { 1400,1580,1220,850,850,0,630,770,850,370,650,730,490,610,690,730},
            { 770,950,590,220,220,630,0,140,220,260,540,620,380,500,580,620},
            { 630,810,450,360,360,770,140,0,140,400,680,760,520,640,720,760},
            { 770,950,590,440,440,850,220,140,0,480,760,840,600,720,800,840},
            { 1030,1210,850,480,480,370,260,400,480,0,280,360,120,240,320,360},
            { 1310,1490,1130,760,760,650,540,680,760,280,0,400,160,280,360,400},
            { 1390,1570,1270,840,840,730,620,760,840,360,400,0,240,120,240,240},
            { 1150,1330,970,600,600,490,380,520,600,120,160,240,0,120,200,240},
            { 1270,1450,1090,720,720,610,500,640,720,240,280,120,120,0,120,120},
            { 1350,1530,1170,800,800,690,580,720,800,320,360,240,200,120,0,150},
            { 1390,1570,1210,840,840,730,620,760,840,360,400,240,240,120,150,0},
        };
        string[,] ms1 = {
            { "无","牌坊-数计院","牌坊-行政楼","牌坊-行政楼-实验楼-传设院-图书馆",
                "牌坊-行政楼-实验楼-传设院-体育馆","牌坊-行政楼-实验楼-传设院-校门/地道-校门","牌坊-行政楼-实验楼-传设院","牌坊-行政楼-实验楼",
                "牌坊-行政楼-实验楼-工学院","牌坊-行政楼-实验楼-传设院-校门/地道","牌坊-行政楼-实验楼-传设院-校门/地道-格致园-明六","牌坊-行政楼-实验楼-传设院-校门/地道-格致园-饭堂-明德园",
                "牌坊-行政楼-实验楼-传设院-校门/地道-格致园","牌坊-行政楼-实验楼-传设院-校门/地道-格致园-饭堂","牌坊-行政楼-实验楼-传设院-校门/地道-格致园-慎思园","牌坊-行政楼-实验楼-传设院-校门/地道-格致园-饭堂-至善园"},
            { "数计院-牌坊","无","数计院-牌坊-行政楼","数计院-牌坊-行政楼-实验楼-传设院-图书馆",
                "数计院-牌坊-行政楼-实验楼-传设院-体育馆","数计院-牌坊-行政楼-实验楼-传设院-校门/地道-校门","数计院-牌坊-行政楼-实验楼-传设院","数计院-牌坊-行政楼-实验楼",
                "数计院-牌坊-行政楼-实验楼-工学院","数计院-牌坊-行政楼-实验楼-传设院-校门/地道","数计院-牌坊-行政楼-实验楼-传设院-校门/地道-格致园-明六","数计院-牌坊-行政楼-实验楼-传设院-校门/地道-格致园-饭堂-明德园",
                "数计院-牌坊-行政楼-实验楼-传设院-校门/地道-格致园","数计院-牌坊-行政楼-实验楼-传设院-校门/地道-格致园-饭堂","数计院-牌坊-行政楼-实验楼-传设院-校门/地道-格致园-慎思园","数计院-牌坊-行政楼-实验楼-传设院-校门/地道-格致园-饭堂-至善园"},
            { "行政楼-牌坊","行政楼-牌坊-数计院","无","行政楼-实验楼-传设院-图书馆",
                "行政楼-实验楼-传设院-体育馆","行政楼-实验楼-传设院-校门/地道-校门","行政楼-实验楼-传设院","行政楼-实验楼",
                "行政楼-实验楼-工学院","行政楼-实验楼-传设院-校门/地道","行政楼-实验楼-传设院-校门/地道-格致园-明六","行政楼-实验楼-传设院-校门/地道-格致园-饭堂-明德园",
                "行政楼-实验楼-传设院-校门/地道-格致园","行政楼-实验楼-传设院-校门/地道-格致园-饭堂","行政楼-实验楼-传设院-校门/地道-格致园-慎思园","行政楼-实验楼-传设院-校门/地道-格致园-饭堂-至善园"},
            { "图书馆-传设院-实验楼-行政楼-牌坊","图书馆-传设院-实验楼-行政楼-牌坊-数计院","图书馆-传设院-实验楼-行政楼","无",
                "图书馆-传设院-体育馆","图书馆-传设院-校门/地道-校门","图书馆-传设院","图书馆-传设院-实验楼",
                "图书馆-传设院-工学院","图书馆-传设院-校门/地道","图书馆-传设院-校门/地道-格致园-明六","图书馆-传设院-校门/地道-格致园-饭堂-明德园",
                "图书馆-传设院-校门/地道-格致园","图书馆-传设院-校门/地道-格致园-饭堂","图书馆-传设院-校门/地道-格致园-慎思园","图书馆-传设院-校门/地道-格致园-饭堂-至善园"},
            { "体育馆-传设院-实验楼-行政楼-牌坊","体育馆-传设院-实验楼-行政楼-牌坊-数计院","体育馆-传设院-实验楼-行政楼","体育馆-传设院-图书馆",
                "无","体育馆-传设院-校门/地道-校门","体育馆-传设院","体育馆-传设院-实验楼",
                "体育馆-传设院-工学院","体育馆-传设院-校门/地道","体育馆-传设院-校门/地道-格致园-明六","体育馆-传设院-校门/地道-格致园-饭堂-明德园",
                "体育馆-传设院-校门/地道-格致园","体育馆-传设院-校门/地道-格致园-饭堂","体育馆-传设院-校门/地道-格致园-慎思园","体育馆-传设院-校门/地道-格致园-饭堂-至善园"},
            { "校门-校门/地道-传设院-实验楼-行政楼-牌坊","校门-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","校门-校门/地道-传设院-实验楼-行政楼","校门-校门/地道-传设院-图书馆",
                "校门-校门/地道-传设院-体育馆","无","校门-校门/地道-传设院","校门-校门/地道-传设院-实验楼",
                "校门-校门/地道-传设院-工学院","校门-校门/地道","校门-校门/地道-格致园-明六","校门-校门/地道-格致园-饭堂-明德园",
                "校门-校门/地道-格致园","校门-校门/地道-格致园-饭堂","校门-校门/地道-格致园-慎思园","校门-校门/地道-格致园-饭堂-至善园"},
            { "传设院-实验楼-行政楼-牌坊","传设院-实验楼-行政楼-牌坊-数计院","传设院-实验楼-行政楼","传设院-图书馆",
                "传设院-体育馆","传设院-校门/地道-校门","无","传设院-实验楼",
                "传设院-工学院","传设院-校门/地道","传设院-校门/地道-格致园-明六","传设院-校门/地道-格致园-饭堂-明德园",
                "传设院-校门/地道-格致园","传设院-校门/地道-格致园-饭堂","传设院-校门/地道-格致园-慎思园","传设院-校门/地道-格致园-饭堂-至善园"},
            { "实验楼-行政楼-牌坊","实验楼-行政楼-牌坊-数计院","实验楼-行政楼","实验楼-传设院-图书馆",
                "实验楼-传设院-体育馆","实验楼-传设院-校门/地道-校门","实验楼-传设院","无",
                "实验楼-工学院","实验楼-传设院-校门/地道","实验楼-传设院-校门/地道-格致园-明六","实验楼-传设院-校门/地道-格致园-饭堂-明德园",
                "实验楼-传设院-校门/地道-格致园","实验楼-传设院-校门/地道-格致园-饭堂","实验楼-传设院-校门/地道-格致园-慎思园","实验楼-传设院-校门/地道-格致园-饭堂-至善园"},
            { "工学院-实验楼-行政楼-牌坊","工学院-实验楼-行政楼-牌坊-数计院","工学院-实验楼-行政楼","工学院-传设院-图书馆",
                "工学院-传设院-体育馆","工学院-传设院-校门/地道-校门","工学院-传设院","工学院-实验楼",
                "无","工学院-传设院-校门/地道","工学院-传设院-校门/地道-格致园-明六","工学院-传设院-校门/地道-格致园-饭堂-明德园",
                "工学院-传设院-校门/地道-格致园","工学院-传设院-校门/地道-格致园-饭堂","工学院-传设院-校门/地道-格致园-慎思园","工学院-传设院-校门/地道-格致园-饭堂-至善园"},
            { "校门/地道-传设院-实验楼-行政楼-牌坊","校门/地道-传设院-实验楼-行政楼-牌坊-数计院","校门/地道-传设院-实验楼-行政楼","校门/地道-传设院-图书馆",
                "校门/地道-传设院-体育馆","校门/地道-校门","校门/地道-传设院","校门/地道-传设院-实验楼",
                "校门/地道-传设院-工学院","无","校门/地道-格致园-明六","校门/地道-格致园-饭堂-明德园",
                "校门/地道-格致园","校门/地道-格致园-饭堂","校门/地道-格致园-慎思园","校门/地道-格致园-饭堂-至善园"},
            { "明六-格致园-校门/地道-传设院-实验楼-行政楼-牌坊","明六-格致园-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","明六-格致园-校门/地道-传设院-实验楼-行政楼","明六-格致园-校门/地道-传设院-图书馆",
                "明六-格致园-校门/地道-传设院-体育馆","明六-格致园-校门/地道-校门","明六-格致园-校门/地道-传设院","明六-格致园-校门/地道-传设院-实验楼",
                "明六-格致园-校门/地道-传设院-工学院","明六-格致园-校门/地道","无","明六-格致园-饭堂-明德园",
                "明六-格致园","明六-格致园-饭堂","明六-格致园-慎思园","明六-格致园-饭堂-至善园"},
            { "明德园-饭堂-格致园-校门/地道-传设院-实验楼-行政楼-牌坊","明德园-饭堂-格致园-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","明德园-饭堂-格致园-校门/地道-传设院-实验楼-行政楼","明德园-饭堂-格致园-校门/地道-传设院-图书馆",
                "明德园-饭堂-格致园-校门/地道-传设院-体育馆","明德园-饭堂-格致园-校门/地道-校门","明德园-饭堂-格致园-校门/地道-传设院","明德园-饭堂-格致园-校门/地道-传设院-实验楼",
                "明德园-饭堂-格致园-校门/地道-传设院-工学院","明德园-饭堂-格致园-校门/地道","明德园-饭堂-格致园-明六","无",
                "明德园-饭堂-格致园","明德园-饭堂","明德园-饭堂-慎思园","明德园-饭堂-至善园"},
            { "格致园-校门/地道-传设院-实验楼-行政楼-牌坊","格致园-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","格致园-校门/地道-传设院-实验楼-行政楼","格致园-校门/地道-传设院-图书馆",
                "格致园-校门/地道-传设院-体育馆","格致园-校门/地道-校门","格致园-校门/地道-传设院","格致园-校门/地道-传设院-实验楼",
                "格致园-校门/地道-传设院-工学院","格致园-校门/地道","格致园-明六","格致园-饭堂-明德园",
                "无","格致园-饭堂","格致园-慎思园","格致园-至善园"},
            { "饭堂-格致园-校门/地道-传设院-实验楼-行政楼-牌坊","饭堂-格致园-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","饭堂-格致园-校门/地道-传设院-实验楼-行政楼","饭堂-格致园-校门/地道-传设院-图书馆",
                "饭堂-格致园-校门/地道-传设院-体育馆","饭堂-格致园-校门/地道-校门","饭堂-格致园-校门/地道-传设院","饭堂-格致园-校门/地道-传设院-实验楼",
                "饭堂-格致园-校门/地道-传设院-工学院","饭堂-格致园-校门/地道","饭堂-格致园-明六","饭堂-明德园",
                "饭堂-格致园","无","饭堂-慎思园","饭堂-至善园"},
            { "慎思园-格致园-校门/地道-传设院-实验楼-行政楼-牌坊","慎思园-格致园-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","慎思园-格致园-校门/地道-传设院-实验楼-行政楼","慎思园-格致园-校门/地道-传设院-图书馆",
                "慎思园-格致园-校门/地道-传设院-体育馆","慎思园-格致园-校门/地道-校门","慎思园-格致园-校门/地道-传设院","慎思园-格致园-校门/地道-传设院-实验楼",
                "慎思园-格致园-校门/地道-传设院-工学院","慎思园-格致园-校门/地道","慎思园-格致园-明六","慎思园-饭堂-明德园",
                "慎思园-格致园","慎思园-饭堂","无","慎思园-至善园"},
            { "至善园-饭堂-格致园-校门/地道-传设院-实验楼-行政楼-牌坊","至善园-饭堂-格致园-校门/地道-传设院-实验楼-行政楼-牌坊-数计院","至善园-饭堂-格致园-校门/地道-传设院-实验楼-行政楼","至善园-饭堂-格致园-校门/地道-传设院-图书馆",
                "至善园-饭堂-格致园-校门/地道-传设院-体育馆","至善园-饭堂-格致园-校门/地道-校门","至善园-饭堂-格致园-校门/地道-传设院","至善园-饭堂-格致园-校门/地道-传设院-实验楼",
                "至善园-饭堂-格致园-校门/地道-传设院-工学院","至善园-饭堂-格致园-校门/地道","至善园-饭堂-格致园-明六","至善园-饭堂-明德园",
                "至善园-饭堂-格致园","至善园-饭堂","至善园-慎思园","无"},
        };
        string[,] ms2 = {
            { "无","牌坊-数计院","牌坊-行政楼","牌坊-图书馆",
                "牌坊-图书馆-体育馆","牌坊-图书馆-体育馆-校门","牌坊-图书馆-传设院","牌坊-行政楼-实验楼",
                "牌坊-行政楼-实验楼-工学院","牌坊-图书馆-传设院-校门/地道","牌坊-图书馆-体育馆-校门-明德园-明六","牌坊-图书馆-体育馆-校门-明德园",
                "牌坊-图书馆-传设院-校门/地道-格致园","牌坊-图书馆-体育馆-校门-明德园-饭堂","牌坊-图书馆-体育馆-校门-明德园-饭堂-慎思园","牌坊-图书馆-体育馆-校门-明德园-饭堂-至善园"},
            { "数计院-牌坊","无","数计院-牌坊-行政楼","数计院-图书馆",
                "数计院-图书馆-体育馆","数计院-图书馆-体育馆-校门","数计院-图书馆-传设院","数计院-图书馆-传设院-实验楼",
                "数计院-图书馆-传设院-工学院","数计院-图书馆-传设院-校门/地道","数计院-图书馆-体育馆-校门-明德园-明六","数计院-图书馆-体育馆-校门-明德园",
                "数计院-图书馆-传设院-校门/地道-格致园","数计院-图书馆-体育馆-校门-明德园-饭堂","数计院-图书馆-体育馆-校门-明德园-慎思园","数计院-图书馆-体育馆-校门-明德园-至善园"},
            { "行政楼-牌坊","行政楼-牌坊-数计院","无","行政楼-图书馆",
                "行政楼-图书馆-体育馆","行政楼-图书馆-体育馆-校门","行政楼-图书馆-传设院","行政楼-实验楼",
                "行政楼-实验楼-工学院","行政楼-图书馆-传设院-校门/地道","行政楼-图书馆-体育馆-校门-明德园-明六","行政楼-图书馆-体育馆-校门-明德园",
                "行政楼-图书馆-传设院-校门/地道-格致园","行政楼-图书馆-体育馆-校门-明德园-饭堂","行政楼-图书馆-体育馆-校门-明德园-饭堂-慎思园","行政楼-图书馆-体育馆-校门-明德园-饭堂-至善园"},
            { "图书馆-牌坊","图书馆-数计院","图书馆-行政楼","无",
                "图书馆-体育馆","图书馆-体育馆-校门","图书馆-传设院","图书馆-传设院-实验楼",
                "图书馆-传设院-工学院","图书馆-传设院-校门/地道","图书馆-体育馆-校门-明德园-明六","图书馆-体育馆-校门-明德园",
                "图书馆-传设院-校门/地道-格致园","图书馆-体育馆-校门-明德园-饭堂","图书馆-体育馆-校门-明德园-饭堂-慎思园","图书馆-体育馆-校门-明德园-饭堂-至善园"},
            { "体育馆-图书馆-牌坊","体育馆-图书馆-数计院","体育馆-图书馆-行政楼","体育馆-图书馆",
                "无","体育馆-校门","体育馆-传设院","体育馆-传设院-实验楼",
                "体育馆-传设院-工学院","体育馆-校门-校门/地道","体育馆-校门-明德园-明六","体育馆-校门-明德园",
                "体育馆-校门-校门/地道-格致园","体育馆-校门-明德园-饭堂","体育馆-校门-明德园-饭堂-慎思园","体育馆-校门-明德园-饭堂-至善园"},
            { "校门-体育馆-图书馆-牌坊","校门-体育馆-图书馆-数计院","校门-体育馆-图书馆-行政楼","校门-体育馆-图书馆",
                "校门-体育馆","无","校门-体育馆-传设院","校门-体育馆-传设院-实验楼",
                "校门-体育馆-传设院-工学院","校门-校门/地道","校门-明德园-明六","校门-明德园",
                "校门-校门/地道-格致园","校门-明德园-饭堂","校门-明德园-饭堂-慎思园","校门-明德园-饭堂-至善园"},
            { "传设院-图书馆-牌坊","传设院-图书馆-数计院","传设院-图书馆-行政楼","传设院-图书馆",
                "传设院-体育馆","传设院-体育馆-校门","无","传设院-实验楼",
                "传设院-工学院","传设院-校门/地道","传设院-校门/地道-明六","传设院-校门/地道-明六-明德园",
                "传设院-校门/地道-格致园","传设院-校门/地道-格致园-饭堂","传设院-校门/地道-格致园-慎思园","传设院-校门/地道-格致园-饭堂-至善园"},
            { "实验楼-行政楼-牌坊","实验楼-传设院-图书馆-数计院","实验楼-行政楼","实验楼-传设院-图书馆",
                "实验楼-传设院-体育馆","实验楼-传设院-体育馆-校门","实验楼-传设院","无",
                "实验楼-工学院","实验楼-传设院-校门/地道","实验楼-传设院-校门/地道-明六","实验楼-传设院-校门/地道-明六-明德园",
                "实验楼-传设院-校门/地道-格致园","实验楼-传设院-校门/地道-格致园-饭堂","实验楼-传设院-校门/地道-格致园-慎思园","实验楼-传设院-校门/地道-格致园-饭堂-至善园"},
            { "工学院-实验楼-行政楼-牌坊","工学院-传设院-图书馆-数计院","工学院-实验楼-行政楼","工学院-传设院-图书馆",
                "工学院-传设院-体育馆","工学院-传设院-体育馆-校门","工学院-传设院","工学院-实验楼",
                "无","工学院-校门/地道","工学院-校门/地道-明六","工学院-校门/地道-明六-明德园",
                "工学院-校门/地道-格致园","工学院-校门/地道-格致园-饭堂","工学院-校门/地道-格致园-慎思园","工学院-校门/地道-格致园-饭堂-至善园"},
            { "校门/地道-传设院-图书馆-牌坊","校门/地道-传设院-图书馆-数计院","校门/地道-传设院-图书馆-行政楼","校门/地道-传设院-图书馆",
                "校门/地道-校门-体育馆","校门/地道-校门","校门/地道-传设院","校门/地道-传设院-实验楼",
                "校门/地道-工学院","无","校门/地道-明六","校门/地道-明六-明德园",
                "校门/地道-格致园","校门/地道-格致园-饭堂","校门/地道-格致园-慎思园","校门/地道-格致园-饭堂-至善园"},
            { "明六-明德园-校门-体育馆-图书馆-牌坊","明六-明德园-校门-体育馆-图书馆-数计院","明六-明德园-校门-体育馆-图书馆-行政楼","明六-明德园-校门-体育馆-图书馆",
                "明六-明德园-校门-体育馆","明六-明德园-校门","明六-校门/地道-传设院","明六-校门/地道-传设院-实验楼",
                "明六-校门/地道-工学院","明六-校门/地道","无","明六-明德园",
                "明六-格致园","明六-明德园-饭堂","明六-明德园-饭堂-慎思园","明六-明德园-饭堂-至善园"},
            { "明德园-校门-体育馆-图书馆-牌坊","明德园-校门-体育馆-图书馆-数计院","明德园-校门-体育馆-图书馆-行政楼","明德园-校门-体育馆-图书馆",
                "明德园-校门-体育馆","明德园-校门","明德园-明六-校门/地道-传设院","明德园-明六-校门/地道-传设院-实验楼",
                "明德园-明六-校门/地道-工学院","明德园-明六-校门/地道","明德园-明六","无",
                "明德园-饭堂-格致园","明德园-饭堂","明德园-饭堂-慎思园","明德园-饭堂-至善园"},
            { "格致园-校门/地道-传设院-图书馆-牌坊","格致园-校门/地道-传设院-图书馆-数计院","格致园-校门/地道-传设院-图书馆-行政楼","格致园-校门/地道-传设院-图书馆",
                "格致园-校门/地道-校门-体育馆","格致园-校门/地道-校门","格致园-校门/地道-传设院","格致园-校门/地道-传设院-实验楼",
                "格致园-校门/地道-工学院","格致园-校门/地道","格致园-明六","格致园-饭堂-明德园",
                "无","格致园-饭堂","格致园-慎思园","格致园-饭堂-至善园"},
            { "饭堂-明德园-校门-体育馆-图书馆-牌坊","饭堂-明德园-校门-体育馆-图书馆-数计院","饭堂-明德园-校门-体育馆-图书馆-行政楼","饭堂-明德园-校门-体育馆-图书馆",
                "饭堂-明德园-校门-体育馆","饭堂-明德园-校门","饭堂-格致园-校门/地道-传设院","饭堂-格致园-校门/地道-传设院-实验楼",
                "饭堂-格致园-校门/地道-工学院","饭堂-格致园-校门/地道","饭堂-明德园-明六","饭堂-明德园",
                "饭堂-格致园","无","饭堂-慎思园","饭堂-至善园"},
            { "慎思园-饭堂-明德园-校门-体育馆-图书馆-牌坊","慎思园-饭堂-明德园-校门-体育馆-图书馆-数计院","慎思园-饭堂-明德园-校门-体育馆-图书馆-行政楼","慎思园-饭堂-明德园-校门-体育馆-图书馆",
                "慎思园-饭堂-明德园-校门-体育馆","慎思园-饭堂-明德园-校门","慎思园-格致园-校门/地道-传设院","慎思园-格致园-校门/地道-传设院-实验楼",
                "慎思园-格致园-校门/地道-工学院","慎思园-格致园-校门/地道","慎思园-饭堂-明德园-明六","慎思园-饭堂-明德园",
                "慎思园-格致园","慎思园-饭堂","无","慎思园-至善园"},
            { "至善园-饭堂-明德园-校门-体育馆-图书馆-牌坊","至善园-饭堂-明德园-校门-体育馆-图书馆-数计院","至善园-饭堂-明德园-校门-体育馆-图书馆-行政楼","至善园-饭堂-明德园-校门-体育馆-图书馆",
                "至善园-饭堂-明德园-校门-体育馆","至善园-饭堂-明德园-校门","至善园-饭堂-格致园-校门/地道-传设院","至善园-饭堂-格致园-校门/地道-传设院-实验楼",
                "至善园-饭堂-格致园-校门/地道-工学院","至善园-饭堂-格致园-校门/地道","至善园-饭堂-明德园-明六","至善园-饭堂-明德园",
                "至善园-饭堂-格致园","至善园-饭堂","至善园-慎思园","无"},
        };
        public Form1()
        {
            InitializeComponent();
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            label30.Visible = false;
            timer1.Enabled = true;
            comboBox1.SelectedIndex = 0;
            comboBox2.SelectedIndex = 15;
            pictureBox1.BackgroundImage = pictureBox2.BackgroundImage;
            textBox1.Text = "中山大学东校区牌坊";
            richTextBox1.Text = "整座门楼用钢筋三合土筑成，外饰面用花岗石砌成。高10.98米，宽25.315米。门额刻有“国立中山大学”六个大字";
        }
        private void button1_Click(object sender, EventArgs e)
        {
            textBox1.Text = "";
            richTextBox1.Text = "";
            pictureBox1.BackgroundImage = pictureBox18.BackgroundImage;
            label30.Visible = true;
        }

        private void timer1_Tick(object sender, EventArgs e)
        {
            Graphics g = this.CreateGraphics();
            Point[] points = { 
                new Point(240, 43), new Point(321, 68), new Point(169, 100),
                new Point(240, 174), new Point(240, 246), new Point(240, 288), 
                new Point(151, 229), new Point(77, 198), new Point(46, 250),
                new Point(90, 334), new Point(151, 346), new Point(218, 361), 
                new Point(107, 418), new Point(192, 430),
                new Point(138, 494), new Point(240, 474) };
            Pen pen = new Pen(Color.Green, 1);
            Pen pen2 = new Pen(Color.Red, 1);
            Pen pen3 = new Pen(Color.Blue, 1);
            g.DrawLine(pen3, points[0], new Point(160, 20));
            g.DrawLine(pen3, points[9], new Point(15, 340));
            g.DrawLine(pen, points[0], points[1]);
            g.DrawLine(pen, points[0], points[2]);
            g.DrawLine(pen, points[2], points[7]);
            g.DrawLine(pen, points[3], points[6]);
            g.DrawLine(pen, points[4], points[6]);
            g.DrawLine(pen, points[6], points[7]);
            g.DrawLine(pen, points[6], points[8]);
            g.DrawLine(pen, points[6], points[9]);
            g.DrawLine(pen, points[7], points[8]);
            g.DrawLine(pen, points[5], points[9]);
            g.DrawLine(pen, points[9], points[12]);
            g.DrawLine(pen, points[10], points[12]);
            g.DrawLine(pen, points[11], points[13]);
            g.DrawLine(pen, points[12], points[13]);
            g.DrawLine(pen, points[13], points[14]);
            g.DrawLine(pen, points[13], points[15]);
            g.DrawLine(pen, points[12], points[14]);
            g.DrawLine(pen, points[14], points[15]);
            g.DrawLine(pen2, points[2], points[3]);
            g.DrawLine(pen2, points[1], points[3]);
            g.DrawLine(pen2, points[10], points[11]);
            g.DrawLine(pen2, points[3], points[4]);
            g.DrawLine(pen2, points[5], points[11]);
            g.DrawLine(pen2, points[0], points[3]);
            g.DrawLine(pen2, points[4], points[5]);
            g.DrawLine(pen2, points[8], points[9]);
            g.DrawLine(pen2, points[9], points[10]);
        }


        private void button19_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox2.BackgroundImage;
            textBox1.Text = "中山大学东校区牌坊";
            richTextBox1.Text = "整座门楼用钢筋三合土筑成，外饰面用花岗石砌成。高10.98米，宽25.315米。门额刻有“国立中山大学”六个大字";
        }

        private void button18_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox3.BackgroundImage;
            textBox1.Text = "数据科学与计算机学院";
            richTextBox1.Text = "中山大学整合了之前好几个学院的优势资源，组建了数据科学与计算机学院。";
        }

        private void button14_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox4.BackgroundImage;
            textBox1.Text = "中山大学东校区行政楼";
            richTextBox1.Text = "听名字应该是行政办公的地方吧\n（百度搜索不到";
        }
        private void button16_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox5.BackgroundImage;
            textBox1.Text = "中山大学东校区图书馆";
            richTextBox1.Text = "又称中东自习室，位置不多，晚点来不好找位置做作业；\n曾经是中东目测最大建筑，不过现在被啥化学学院楼取代了";
        }

        private void button15_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox6.BackgroundImage;
            textBox1.Text = "中山大学东校区体育馆";
            richTextBox1.Text = "除了第一节体育课用来集合之外，还可以用作礼堂和其他活动场所，租金好像是一天两万来着";
        }

        private void button8_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox7.BackgroundImage;
            textBox1.Text = "中山大学东校区校门";
            richTextBox1.Text = "学生们上学的唯二通道。曾经因为中大修校门事件被称为“狗洞”，但是其实说的也挺合理的";
        }

        private void button12_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox8.BackgroundImage;
            textBox1.Text = "中山大学传播与设计学院";
            richTextBox1.Text = "是聚集了一群优质妹子和强势女篮的天堂，但由于院楼构造奇特，又被称为“中东马桶楼”";
        }

        private void button11_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox9.BackgroundImage;
            textBox1.Text = "中山大学东校区南/北实验楼";
            richTextBox1.Text = "同学们平时打码、做祭祖等其他实验的地方，以及许多老师的办公室和实验室也设在里面";
        }

        private void button10_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox10.BackgroundImage;
            textBox1.Text = "中山大学东校区工学院";
            richTextBox1.Text = "除了建筑面前的小广场可以用来举办活动之外，还真不知道有啥其他用处";
        }

        private void button7_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox11.BackgroundImage;
            textBox1.Text = "中山大学东校区地道";
            richTextBox1.Text = "学生们上学的唯二通道，单车党飙车圣地，但是爬坡的时候就会特别累";
        }

        private void button9_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox12.BackgroundImage;
            textBox1.Text = "中山大学东校区明德园六号";
            richTextBox1.Text = "聚集了快递点、理发店、银行等众多日常设施的地方，偶尔也能申请三楼房间用于搞活动";
        }

        private void button5_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox13.BackgroundImage;
            textBox1.Text = "中山大学东校区明德园";
            richTextBox1.Text = "中东宿舍楼之一，特点是离教学区和明六比较近";
        }

        private void button4_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox14.BackgroundImage;
            textBox1.Text = "中山大学东校区格致园";
            richTextBox1.Text = "中东宿舍楼之一，特点是供奉着深圳校区的学生们";
        }

        private void button3_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox16.BackgroundImage;
            textBox1.Text = "中山大学东校区慎思园";
            richTextBox1.Text = "中东宿舍楼之一，特点是南校门封了之后就变得比较偏僻";
        }

        private void button2_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox17.BackgroundImage;
            textBox1.Text = "中山大学东校区至善园";
            richTextBox1.Text = "中东宿舍楼之一，特点是...没有特点";
        }

        private void button6_Click(object sender, EventArgs e)
        {
            label30.Visible = false;
            pictureBox1.BackgroundImage = pictureBox15.BackgroundImage;
            textBox1.Text = "中山大学东校区饭堂";
            richTextBox1.Text = "大致分为四个饭堂，一、二、四饭比较普通，三饭比较好吃比较贵";
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            int r1 = comboBox1.SelectedIndex;
            int r2 = comboBox2.SelectedIndex;
            if (r1 >= 0 && r1 < 16 && r2 >= 0 && r2 < 16)
            {
                label44.Text = matrix2[r1, r2].ToString() + "m";
                label45.Text = matrix1[r1, r2].ToString() + "m";
                richTextBox2.Text = ms1[r1, r2];
                richTextBox3.Text = ms2[r1, r2];
                label28.Text = "约" + (matrix2[r1, r2] != 0 ? ((matrix2[r1, r2] / 333) + 1).ToString() : "0") + "min";
                label29.Text = "约" + (matrix1[r1, r2] != 0 ? ((matrix1[r1, r2] * 5 / 333) + 1).ToString() : "0") + "min";
            }
        }

        private void comboBox2_SelectedIndexChanged(object sender, EventArgs e)
        {
            int r1 = comboBox1.SelectedIndex;
            int r2 = comboBox2.SelectedIndex;
            if (r1 >= 0 && r1 < 16 && r2 >= 0 && r2 < 16)
            {
                label44.Text = matrix2[r1, r2].ToString() + "m";
                label45.Text = matrix1[r1, r2].ToString() + "m";
                richTextBox2.Text = ms1[r1, r2];
                richTextBox3.Text = ms2[r1, r2];
                label28.Text = "约" + (matrix2[r1, r2] != 0 ? ((matrix2[r1, r2] / 333) + 1).ToString() : "0") + "min";
                label29.Text = "约" + (matrix1[r1, r2] != 0 ? ((matrix1[r1, r2] * 5 / 333) + 1).ToString() : "0") + "min";
            }
        }
    }
}
